// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grischa", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

const friends:string[] = ["Ivan", "Slavik", "Grischa", "Lera", "Ira"];
const checkedArrLength = (arr:string[]): string =>{
    if (arr.length >=3){
        return 'кількість елементів у масиві більше або дорівнює 3'
    }else {
        return 'це маленький масив, в якому менше 3-х елементів.'
    }
}
console.log(checkedArrLength(friends))
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

const foo = ( num_1:number, num_2:number, num_3:number ): string =>{
    if (num_1 >= num_2 && num_1 >= num_3){
        return `${num_1} найбільше число`
    }else  if (num_2 > num_1 && num_2 > num_3){
        return `${num_2} найбільше число`
    }else {
        return `${num_3} найбільше число`
    }
}
console.log(foo(1,2,0));

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
const a: number = -2;
const b: number = 2;

const result: string = a + b < 4 ? 'Мало' : 'Багато'

console.log(result)

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//
const checkedNumber:string = a > 0? 'число є позитивним' : a == 0 ? 'число є нулем': 'число є негативним'
console.log(checkedNumber)

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

const test: boolean = false

test ? console.log('Вірно'): console.log('Неправильно')

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

const message:string = prompt('Яка «офіційна» назва JavaScript')

message === 'ECMAScript' ? console.log('«Правильно!»'): console.log('«Не знаєте? ECMAScript!')

// - Ми маємо змінну number в яку користувач задає числове значення,
// якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//

const userNumber:number = +prompt('ведіть число 10')
userNumber === 10 ? console.log('ВІРНО') : console.log('НЕВІРНО')
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

const temperature:number = +prompt('temperature')
if (temperature >= 10 && temperature <= 22){
    console.log('ми йдемо ВЧИТИСЯ')
}else {
    console.log('сидимо вдома і вчимося ОНЛАЙН')

}

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

const number:number = +prompt('enter a number in the range from 1 to 5')
switch (number) {
    case 1:
        console.log('Авто')
        break;
    case 2:
        console.log('Мото')
        break;
    case 3:
        console.log('Телефон')
        break;
    default:
        console.log('game over')
}